---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.CannotCreateArraySelectionIsGrouped
source: html/f1b76e6e-ed3f-5401-d0a7-1d80fa092266.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.CannotCreateArraySelectionIsGrouped Property

Can't create an array because the selection cannot be grouped.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateArraySelectionIsGrouped { get; }
```